Tekla.Structures.DialogInternal.ShapeDialogOwner
For internal use only !
Class to handle native dialog instance

Tekla.Structures.DialogInternal.ShapeDialogOwner.#ctor(Tekla.Structures.DialogInternal.IDialogOwner)
Construct instance to hold the native dialog handle
dialogHandle: Handle to native dialog

Tekla.Structures.DialogInternal.ShapeDialogOwner.Dispose
Dispose implementation for inp dialog

Tekla.Structures.DialogInternal.ShapeDialogOwner.OnValueChanged(Tekla.Structures.DialogInternal.ShapeAttributes)
Process value changed event
attributes: Shape attributes

Tekla.Structures.DialogInternal.ShapeDialogOwner.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data